I will be showing an example of how to obtain Data about a stock for our analysis. In this example we will be using an API called Alpha Vantage and a python library called pandas in order to do this.

pandas is a library that provides fast and intuitive data structures for the use of data analysis.

Alpha Vantage queries can return either a JSON response or a CVS (Comma Seperate Values) response. For the purpose of reading the data using the PANDAS library from python we will be using the CVS format.

The instructions on how to format the queries can be found [here](https://www.alphavantage.co/documentation/).

An example of a query: https://www.alphavantage.co/query?function=TIME_SERIES_MONTHLY_ADJUSTED&symbol=MSFT&apikey=demo&datatype=csv

Following this link will download the example CSV file, though we have provided the file for you.

In [25]:
import pandas
from IPython.display import display # display is used to display the dataframe
stock_data = pandas.read_csv("example.csv") # parses the CSV file into a dataframe
# A csv file can also be read from a URL that provides a CSV file
stock_data = pandas.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_MONTHLY_ADJUSTED&symbol=MSFT&apikey=demo&datatype=csv')

The dataframe and series objects are the two main data structures in pandas.
#### DataFrame

The dataframe is tabular data structure that contains rows(entries) and columns(attributes).

**stock_data = pandas.read_csv("example.csv")** creates a dataframe from the example.csv file and assigns it to the stock_data variable.

The head() method prints the first k rows of a dataframe. The default amount is 5, though we will display the first 10 rows.

In [26]:
print(display(stock_data.head(10))) # displays the first 10 rows in our dataframe

,timestamp,open,high,low,close,adjusted close,volume,dividend amount
0,2018-02-02,94.790,96.0700,91.50,91.78,91.7800,94725628,0.00
1,2018-01-31,86.125,95.4500,85.50,95.01,95.0100,543377322,0.00
2,2017-12-29,83.600,87.4999,80.70,85.54,85.5400,447828256,0.00
3,2017-11-30,83.680,85.0600,82.24,84.17,84.1700,416152260,0.42
4,2017-10-31,74.710,86.2000,73.71,83.18,82.7611,440510118,0.00
5,2017-09-29,74.710,75.9700,72.92,74.49,74.1149,367134396,0.00
6,2017-08-31,73.100,74.9600,71.28,74.77,74.3935,429156682,0.39
7,2017-07-31,69.330,74.4200,68.02,72.70,71.9506,451248934,0.00
8,2017-06-30,70.240,72.8900,68.09,68.93,68.2195,610120893,0.00
9,2017-05-31,68.680,70.7400,67.14,69.84,69.1201,505249296,0.39

None

The line, **from IPython.display import display**, imports a method that is used to format a dataframe when it is printed.

We will now explore some basic features of a dataframe.

In [27]:
print(stock_data.shape)
print(stock_data.shape[0]) # Prints only the number of rows
print(stock_data.shape[1]) # Prints on the number of columns

(217, 8)
217
8

The .shape attribute of dataframes list the number of rows and the number of columns.

In [28]:
print(stock_data.dtypes)

timestamp           object
open               float64
high               float64
low                float64
close              float64
adjusted close     float64
volume               int64
dividend amount    float64
dtype: object

The .dtypes attribute of dataframes lists the name and data type of each column.

In [29]:
new_stock_data = stock_data.drop('volume', axis = 1) # Drops the specified column from a dataframe
print(display(new_stock_data.head()))

    timestamp    open     high    low  close  adjusted close  dividend amount
0  2018-02-02  94.790  96.0700  91.50  91.78         91.7800             0.00
1  2018-01-31  86.125  95.4500  85.50  95.01         95.0100             0.00
2  2017-12-29  83.600  87.4999  80.70  85.54         85.5400             0.00
3  2017-11-30  83.680  85.0600  82.24  84.17         84.1700             0.42
4  2017-10-31  74.710  86.2000  73.71  83.18         82.7611             0.00

None

Here we have created a new dataframe that is identical to stock_data except now the volume column has been removed. Please note that stock_data has not been modified, we merely created a copy. To remove a column from the same dataframe would look like this. **stock_data = stock_data.drop('volume', axis = 1)**

In [30]:
stock_subset = stock_data[['timestamp', 'open', 'close']] # Creates a subset dataframe from another dataframe
print(display(stock_subset.head(5)))

    timestamp    open  close
0  2018-02-02  94.790  91.78
1  2018-01-31  86.125  95.01
2  2017-12-29  83.600  85.54
3  2017-11-30  83.680  84.17
4  2017-10-31  74.710  83.18

None

Here we have created a subset of the dataframe. A subset can contain any number of columns from the original dataframe. Take note of how the column names are enclosed with double brackets.
# to do : continue from here with more functionality of dataframes.

#### Series
A series is a one dimensional array that is used to that can be used to store a single column from a dataframe.

In [31]:
close_series = stock_data['close'] # Assigns the close column from the dataframe to the series variable, close_series
print(display(close_series.head(10))) # prints the first ten rows in the series

0    91.78
1    95.01
2    85.54
3    84.17
4    83.18
5    74.49
6    74.77
7    72.70
8    68.93
9    69.84
Name: close, dtype: float64

None

**stock_data['close']** allows us to access a single column in the dataframe. If you wish to use a different column then simply change the string to the name of the column.